In [5]:
from splinter import Browser
from bs4 import BeautifulSoup
from webdriver_manager.chrome import ChromeDriverManager
import pandas as pd
import ssl
import requests

In [6]:
executable_path = {'executable_path': ChromeDriverManager().install()}
browser = Browser('chrome', **executable_path, headless=False)

In [7]:
 url = 'https://data-class-mars-challenge.s3.amazonaws.com/Mars/index.html'
data = requests.get(url).text

In [88]:
weather= pd.read_html(url)
table=weather[0]
table

        id terrestrial_date   sol   ls  month  min_temp  pressure
0        2       2012-08-16    10  155      6     -75.0     739.0
1       13       2012-08-17    11  156      6     -76.0     740.0
2       24       2012-08-18    12  156      6     -76.0     741.0
3       35       2012-08-19    13  157      6     -74.0     732.0
4       46       2012-08-20    14  157      6     -74.0     740.0
...    ...              ...   ...  ...    ...       ...       ...
1862  1889       2018-02-23  1973  133      5     -78.0     730.0
1863  1892       2018-02-24  1974  134      5     -77.0     729.0
1864  1894       2018-02-25  1975  134      5     -76.0     729.0
1865  1893       2018-02-26  1976  135      5     -77.0     728.0
1866  1895       2018-02-27  1977  135      5     -77.0     727.0

[1867 rows x 7 columns]

How many months exist on Mars?
Using the number of martial months used in the table there are 12 months on Mars.

In [87]:
months =table.loc[:,'month'].unique()
months

array([ 6,  7,  8,  9, 10, 11, 12,  1,  2,  3,  4,  5], dtype=int64)

Which month, on average, has the lowest temperature? The highest?

Looking at the avg"min_temp" by month, martian month 3 has the lowest temperature,while the month with the highest temperature is martian month 8

In [100]:
min_temps= table.groupby('month')['min_temp'].mean()
print(min_temps.min())
print(min_temps.max())
min_temps

-83.30729166666667
-68.38297872340425

month
1    -77.160920
2    -79.932584
3    -83.307292
4    -82.747423
5    -79.308725
6    -75.299320
7    -72.281690
8    -68.382979
9    -69.171642
10   -71.982143
11   -71.985507
12   -74.451807
Name: min_temp, dtype: float64

Which month, on average, has the lowest atmospheric pressure? The highest?

Martian Month 6 has the lowest atmospheric pressure, while martian month 9 has the highest

In [101]:
atmo= table.groupby('month')['pressure'].mean()
print(atmo.min())
print(atmo.max())
atmo

745.0544217687075
913.3059701492538

month
1     862.488506
2     889.455056
3     877.322917
4     806.329897
5     748.557047
6     745.054422
7     795.105634
8     873.829787
9     913.305970
10    887.312500
11    857.014493
12    842.156627
Name: pressure, dtype: float64

How many terrestrial days exist in a Martian year? A visual estimate within 25% was made.

There are 7,468 days in a Martian Year

In [107]:
days = table.loc[:,'terrestrial_date'].count()
martian_days= days*4
martian_days

7468

In [112]:
New_csv = table.to_csv('Mars_Temp_Data.csv')

NameError: name 'new_csv' is not defined